{
  "Evergreen | Perennes": [
    {
      "keyword": "Deathtouch",
      "keyword_es": "Toque mortal",
      "definition": "Whenever a creature with deathtouch deals damage to another creature, that creature will die.",
      "definition_es": "Cuando una criatura con toque mortal hace daño a otra criatura, esa criatura muere.",
      "details": [
        "It does not have to be combat damage.",
        "Normal deathtouch doesn't kill planeswalkers, but some cards can grant 'planeswalker deathtouch'."
      ],
      "details_es": [
        "No tiene que ser daño de combate.",
        "El toque mortal normal no mata planeswalkers, pero algunas cartas pueden otorgar 'toque mortal a planeswalkers'."
      ],
      "example_card": "Sedge Scorpion",
      "example_card_es": "Escorpión de juncal"
    },
    {
      "keyword": "Defender",
      "keyword_es": "Defensor",
      "definition": "Creature cannot attack.",
      "definition_es": "La criatura no puede atacar.",
      "details": [
        "Historically, Walls couldn't attack even without the defender keyword."
      ],
      "details_es": [
        "Históricamente, los Muros no podían atacar incluso sin la palabra clave defensor."
      ],
      "example_card": "Wall of Mist",
      "example_card_es": "Muro de niebla"
    },
    {
      "keyword": "Double Strike",
      "keyword_es": "Golpe doble",
      "definition": "Creature deals both first strike damage and regular damage.",
      "definition_es": "La criatura hace daño de primer golpe y daño normal.",
      "example_card": "Boros Swiftblade",
      "example_card_es": "Espada veloz de Boros"
    },
    {
      "keyword": "Enchant",
      "keyword_es": "Encantar",
      "definition": "Written as 'Enchant X' where X is a permanent type. These are auras.",
      "definition_es": "Escrito como 'Encantar X' donde X es un tipo de permanente. Estas son auras.",
      "details": [
        "Auras must have a target when cast. If the target is removed, the aura goes to the graveyard."
      ],
      "details_es": [
        "Las auras deben tener un objetivo cuando se lanzan. Si el objetivo es removido, el aura va al cementerio."
      ],
      "example_card": "Abundant Growth",
      "example_card_es": "Crecimiento abundante"
    },
    {
      "keyword": "Equip",
      "keyword_es": "Equipar",
      "definition": "Written as 'Equip X' where X is a mana cost. These are equipment.",
      "definition_es": "Escrito como 'Equipar X' donde X es un coste de maná. Estos son equipamientos.",
      "details": [
        "Equipment can be attached to creatures by paying the equip cost.",
        "Activate only as a sorcery unless otherwise stated."
      ],
      "details_es": [
        "Los equipamientos pueden ser acoplados a criaturas pagando su coste de equipar.",
        "Actívalo sólo como un conjuro a menos que se indique lo contrario."
      ],
      "example_card": "Sword of Feast and Famine",
      "example_card_es": "Espada de festín y hambruna"
    },
    {
      "keyword": "First Strike",
      "keyword_es": "Primer golpe",
      "definition": "Creature with first strike deals damage before creatures without first strike in combat.",
      "definition_es": "Las criaturas con primer golpe hacen daño antes que las criaturas sin primer golpe en combate.",
      "example_card": "Battle Hurda",
      "example_card_es": "Hurda de batalla"
    },
    {
      "keyword": "Flash",
      "keyword_es": "Destello",
      "definition": "Permits you to cast those spells whenever you could cast an instant.",
      "definition_es": "Te permite lanzar esos hechizos cuando podrías lanzar un instantáneo.",
      "details": [
        "This is on nonland permanent cards (creatures, artifacts, enchantments, planeswalkers)."
      ],
      "details_es": [
        "Esto está en cartas de permanente que no son tierras (criaturas, artefactos, encantamientos, planeswalkers)."
      ],
      "example_card": "Bounding Krasis",
      "example_card_es": "Krasis saltarín"
    },
    {
      "keyword": "Flying",
      "keyword_es": "Vuelo",
      "definition": "Creatures with flying can only be blocked by other creatures with flying or with reach.",
      "definition_es": "Las criaturas con vuelo sólo pueden ser bloqueadas por otras criaturas con vuelo o alcance.",
      "example_card": "Storm Crow",
      "example_card_es": "Cuervo de tormenta"
    },
    {
      "keyword": "Haste",
      "keyword_es": "Prisa",
      "definition": "Creatures with haste may attack or activate 'tap' abilities the turn they come into play.",
      "definition_es": "Las criaturas con prisa pueden atacar o activar habilidades de 'girar' el turno en que entran en juego.",
      "example_card": "Tenement Crasher",
      "example_card_es": "Demoledor de vecindad"
    },
    {
      "keyword": "Lifelink",
      "keyword_es": "Vínculo vital",
      "definition": "Whenever a creature with lifelink deals damage, you gain life equal to the amount of damage.",
      "definition_es": "Cuando una criatura con vínculo vital hace daño, ganas una cantidad de vida igual al daño hecho.",
      "details": [
        "All damage happens at the same time. Lifelink can save you from lethal damage."
      ],
      "details_es": [
        "Todo el daño ocurre al mismo tiempo. El vínculo vital puede salvarte de daño letal."
      ],
      "example_card": "Bishop's Soldier",
      "example_card_es": "Soldado del obispo"
    },
    {
      "keyword": "Menace",
      "keyword_es": "Amenaza",
      "definition": "Creatures with menace can only be blocked by 2 or more creatures.",
      "definition_es": "Las criaturas con amenaza sólo pueden ser bloqueadas por 2 o más criaturas.",
      "example_card": "Ruin Grinder",
      "example_card_es": "Moledor de ruinas"
    },
    {
      "keyword": "Protection",
      "keyword_es": "Protección",
      "definition": "Written as 'Protection from X'. A creature with protection cannot be damaged, blocked, targeted, enchanted, or equipped by something of that color.",
      "definition_es": "Escrito como 'Protección contra X'. Una criatura con protección no puede ser dañada, bloqueada, objetivo de, encantada o equipada por algo de ese color.",
      "details": [
        "Protection prevents damage but does not stop 'destroy all creatures' spells."
      ],
      "details_es": [
        "La protección previene el daño pero no detiene hechizos de 'destruir todas las criaturas'."
      ],
      "example_card": "Apostle of Purifying Light",
      "example_card_es": "Apóstol de la luz purificadora"
    },
    {
      "keyword": "Prowess",
      "keyword_es": "Destreza",
      "definition": "Whenever you cast a noncreature spell, creatures with prowess get +1/+1 until end of turn.",
      "definition_es": "Cuando lanzas un hechizo que no es criatura, las criaturas con destreza obtienen +1/+1 hasta el final del turno.",
      "example_card": "Monastery Swiftspear",
      "example_card_es": "Lancera veloz del monasterio"
    },
    {
      "keyword": "Reach",
      "keyword_es": "Alcance",
      "definition": "Creatures with reach may block creatures with flying.",
      "definition_es": "Las criaturas con alcance pueden bloquear criaturas con vuelo.",
      "example_card": "Giant Spider",
      "example_card_es": "Araña gigante"
    },
    {
      "keyword": "Trample",
      "keyword_es": "Arrollar",
      "definition": "Creatures with trample deal excess damage to the defending player.",
      "definition_es": "Las criaturas con arrollar hacen daño excedente al jugador defensor.",
      "details": [
        "Only lethal damage needs to be assigned to a blocker for trample damage to be dealt to the player."
      ],
      "details_es": [
        "Sólo se necesita asignar daño letal a un bloqueador para que el daño excedente vaya al jugador."
      ],
      "example_card": "Colossal Dreadmaw",
      "example_card_es": "Fauces temibles colosales"
    },
    {
      "keyword": "Vigilance",
      "keyword_es": "Vigilancia",
      "definition": "Attacking does not cause the creature to tap.",
      "definition_es": "Atacar no hace que la criatura se gire.",
      "example_card": "Serra Angel",
      "example_card_es": "Ángel de Serra"
    },
    {
      "keyword": "Ward",
      "keyword_es": "Custodia",
      "definition": "Written as 'Ward [cost]'. If a creature with ward becomes the target of a spell or ability an opponent controls, counter that spell unless the opponent pays the ward cost.",
      "definition_es": "Escrito como 'Custodia [coste]'. Si una criatura con custodia se convierte en objetivo de un hechizo o habilidad que controla un oponente, contrarresta ese hechizo a menos que el oponente pague el coste de custodia.",
      "example_card": "Dreadlight Monstrosity",
      "example_card_es": "Monstruosidad luz temible"
    }
  ],
  "Actions | Acciones": [
    {
      "keyword": "Attach",
      "keyword_es": "Acoplar",
      "definition": "Used on auras, equipment, and fortifications to 'put on' a permanent.",
      "definition_es": "Usado en auras, equipamientos y fortificaciones para 'poner' en un permanente.",
      "example_card": "Darksteel Garrison",
      "example_card_es": "Guarnición de aceroscuro"
    },
    {
      "keyword": "Clash",
      "keyword_es": "Enfrentar",
      "definition": "When a spell tells players to clash, each player reveals the top card of their library. The player with the higher mana value wins the clash.",
      "definition_es": "Cuando un hechizo dice a los jugadores que se enfrenten, cada jugador revela la carta superior de su biblioteca. El jugador con el mayor valor de maná gana el enfrentamiento.",
      "example_card": "Fire Juggler",
      "example_card_es": "Malabarista de fuego"
    },
    {
      "keyword": "Counter",
      "keyword_es": "Contrarrestar",
      "definition": "Countering a spell or ability removes it from the stack.",
      "definition_es": "Contrarrestar un hechizo o habilidad lo remueve de la pila.",
      "example_card": "Counterspell",
      "example_card_es": "Contrahechizo"
    },
    {
      "keyword": "Reconfigure",
      "keyword_es": "Reconfigurar",
      "definition": "Written as 'Reconfigure X' where X is a mana cost. These are artifact creatures that are also equipment.",
      "definition_es": "Escrito como 'Reconfigurar X' donde X es un coste de maná. Estos son criaturas artefacto que también son equipamientos.",
      "details": [
        "Reconfigure can attach and unattach from a creature."
      ],
      "details_es": [
        "Reconfigurar puede acoplarse y desacoplarse de una criatura."
      ],
      "example_card": "The Reality Chip",
      "example_card_es": "El chip de la realidad"
    },
    {
      "keyword": "Regeneration",
      "keyword_es": "Regeneración",
      "definition": "When the regeneration cost is paid, it gives that permanent a 'regeneration shield' for the rest of the turn.",
      "definition_es": "Cuando se paga el coste de regeneración, le da a ese permanente un 'escudo de regeneración' por el resto del turno.",
      "details": [
        "If the permanent would be destroyed, it is tapped instead."
      ],
      "details_es": [
        "Si el permanente fuera a ser destruido, en vez de eso se gira."
      ],
      "example_card": "Ancient Silverback",
      "example_card_es": "Espalda plateada ancestral"
    },
    {
      "keyword": "Sacrifice",
      "keyword_es": "Sacrificar",
      "definition": "The owner of a permanent places it into their own graveyard due to an effect or spell.",
      "definition_es": "El dueño de un permanente lo coloca en su propio cementerio debido a un efecto o hechizo.",
      "example_card": "Chainer's Edict",
      "example_card_es": "Edicto de Chainer"
    },
    {
      "keyword": "Scry",
      "keyword_es": "Adivinar",
      "definition": "Written as 'Scry X' where X is a number. Look at the top X cards of your library, put any number on the bottom, and the rest back in any order.",
      "definition_es": "Escrito como 'Adivinar X' donde X es un número. Mira las X cartas superiores de tu biblioteca, pon cualquier cantidad en el fondo y el resto de vuelta en cualquier orden.",
      "example_card": "Crystal Ball",
      "example_card_es": "Bola de cristal"
    },
    {
      "keyword": "Tap/Untap",
      "keyword_es": "Girar/Enderezar",
      "definition": "Allows you to tap or untap a permanent.",
      "definition_es": "Te permite girar o enderezar un permanente."
    }
  ],
  "Expansion | Expansion": [
    {
      "keyword": "Absorb",
      "keyword_es": "Absorber",
      "definition": "Written as 'Absorb X' where X is a number. When the creature with absorb is dealt damage, it prevents X damage.",
      "definition_es": "Escrito como 'Absorber X' donde X es un número. Cuando a la criatura con absorber se le hace daño, previene X daño.",
      "example_card": "Lymph Sliver",
      "example_card_es": "Fragmento linfa"
    },
    {
      "keyword": "Adapt",
      "keyword_es": "Adaptar",
      "definition": "Written as '[cost] Adapt X'. When the adapt cost is paid, put X +1/+1 counters on the creature.",
      "definition_es": "Escrito como '[coste] Adaptar X'. Cuando se paga el coste de adaptar, pon X contadores +1/+1 en la criatura.",
      "example_card": "Growth-Chamber Guardian",
      "example_card_es": "Guardián de la cámara de crecimiento"
    },
    {
      "keyword": "Adventure",
      "keyword_es": "Aventura",
      "definition": "On a card with adventure, you may cast a spell for its adventure cost. If you do, exile that card. You may then cast the creature side from exile.",
      "definition_es": "En una carta con aventura, puedes lanzar un hechizo por su coste de aventura. Si lo haces, exilia esa carta. Luego puedes lanzar el lado de criatura desde el exilio.",
      "example_card": "Bonecrusher Giant",
      "example_card_es": "Gigante triturahuesos"
    },
    {
      "keyword": "Affinity",
      "keyword_es": "Afinidad",
      "definition": "Written as 'Affinity for X'. Affinity causes the generic mana in a casting cost to be reduced by the number of permanents of the X type you control.",
      "definition_es": "Escrito como 'Afinidad por X'. La afinidad reduce el maná genérico en un coste de lanzamiento por la cantidad de permanentes del tipo X que controlas.",
      "example_card": "Thoughtcast",
      "example_card_es": "Lanzamiento mental"
    },
    {
      "keyword": "Afterlife",
      "keyword_es": "Más allá",
      "definition": "Written as 'Afterlife X'. When a creature with afterlife dies, its controller creates X 1/1 black and white spirit tokens with flying.",
      "definition_es": "Escrito como 'Más allá X'. Cuando una criatura con más allá muere, su controlador crea X fichas de espíritu 1/1 blancas y negras con vuelo.",
      "example_card": "Orzhov Enforcer",
      "example_card_es": "Déspota de Orzhov"
    },
    {
      "keyword": "Aftermath",
      "keyword_es": "Secuelas",
      "definition": "Only on split cards. One side may only be cast from your hand, the other side may only be cast from the graveyard.",
      "definition_es": "Sólo en cartas divididas. Un lado sólo puede lanzarse desde tu mano, el otro lado sólo puede lanzarse desde el cementerio.",
      "example_card": "Commit to Memory",
      "example_card_es": "Comprometerse con la memoria"
    },
    {
      "keyword": "Alliance",
      "keyword_es": "Alianza",
      "definition": "Basically 'Landfall', but on creatures. Whenever another creature enters, some effect happens.",
      "definition_es": "Básicamente 'Aterrizaje', pero en criaturas. Cuando otra criatura entra, ocurre algún efecto.",
      "example_card": "Gala Greeters",
      "example_card_es": "Saludadores de gala"
    },
    {
      "keyword": "Amplify",
      "keyword_es": "Amplificar",
      "definition": "Written as 'Amplify X'. When you cast a card with amplify, you may reveal cards that share a type with it. The card enters with +1/+1 counters equal to X times the number of revealed cards.",
      "definition_es": "Escrito como 'Amplificar X'. Cuando lanzas una carta con amplificar, puedes revelar cartas que compartan tipo con ella. La carta entra con contadores +1/+1 iguales a X por la cantidad de cartas reveladas.",
      "example_card": "Kilnmouth Dragon",
      "example_card_es": "Dragón boca de horno"
    },
    {
      "keyword": "Annihilator",
      "keyword_es": "Aniquilador",
      "definition": "Written as 'Annihilator X'. Whenever a creature with annihilator attacks, the defending player sacrifices X permanents.",
      "definition_es": "Escrito como 'Aniquilador X'. Cuando una criatura con aniquilador ataca, el jugador defensor sacrifica X permanentes.",
      "example_card": "Ulamog's Crusher",
      "example_card_es": "Triturador de Ulamog"
    },
    {
      "keyword": "Aura Swap",
      "keyword_es": "Intercambio de aura",
      "definition": "Written as 'Aura Swap X'. When a card with aura swap is attached to a creature, you may pay the cost to return it to your hand and attach an aura from your hand to the same creature.",
      "definition_es": "Escrito como 'Intercambio de aura X'. Cuando una carta con intercambio de aura está acoplada a una criatura, puedes pagar el coste para devolverla a tu mano y acoplar un aura de tu mano a la misma criatura.",
      "example_card": "Arcanum Wings",
      "example_card_es": "Alas de arcano"
    },
    {
      "keyword": "Banding",
      "keyword_es": "Formación de bandas",
      "definition": "Historically, the most complicated mechanic in MTG. Allows you to distribute combat damage among your creatures.",
      "definition_es": "Históricamente, la mecánica más complicada en MTG. Te permite distribuir daño de combate entre tus criaturas.",
      "example_card": "Knights of Thorn",
      "example_card_es": "Caballeros de espina"
    },
    {
      "keyword": "Battle Cry",
      "keyword_es": "Grito de batalla",
      "definition": "Whenever a creature with battle cry attacks, other attacking creatures get +1/+0 until end of turn.",
      "definition_es": "Cuando una criatura con grito de batalla ataca, otras criaturas atacantes obtienen +1/+0 hasta el final del turno.",
      "example_card": "Signal Pest",
      "example_card_es": "Alimaña señal"
    },
    {
      "keyword": "Bestow",
      "keyword_es": "Otorgar",
      "definition": "Written as 'Bestow [cost]'. When you pay the bestow cost, you use a creature as an aura for a creature on the battlefield.",
      "definition_es": "Escrito como 'Otorgar [coste]'. Cuando pagas el coste de otorgar, usas una criatura como aura para una criatura en el campo de batalla.",
      "example_card": "Celestial Archon",
      "example_card_es": "Arcón celestial"
    },
    {
      "keyword": "Blitz",
      "keyword_es": "Ataque relámpago",
      "definition": "Written as 'Blitz [cost]'. You may cast a card for its blitz cost. If you do, it gains haste and is sacrificed at the next end step.",
      "definition_es": "Escrito como 'Ataque relámpago [coste]'. Puedes lanzar una carta por su coste de ataque relámpago. Si lo haces, gana prisa y es sacrificada al siguiente paso final.",
      "example_card": "None provided",
      "example_card_es": "No proporcionado"
    },
    {
      "keyword": "Bloodrush",
      "keyword_es": "Ira sangrienta",
      "definition": "Written as 'Bloodrush [cost]'. You may discard a creature with bloodrush by paying its bloodrush cost to grant a boost to another creature.",
      "definition_es": "Escrito como 'Ira sangrienta [coste]'. Puedes descartar una criatura con ira sangrienta pagando su coste para otorgar una mejora a otra criatura.",
      "example_card": "Skarrg Goliath",
      "example_card_es": "Goliat de Skarrg"
    },
    {
      "keyword": "Bloodthirst",
      "keyword_es": "Sed de sangre",
      "definition": "Written as 'Bloodthirst X'. Creatures with bloodthirst enter the battlefield with X +1/+1 counters if an opponent was dealt damage this turn.",
      "definition_es": "Escrito como 'Sed de sangre X'. Las criaturas con sed de sangre entran al campo de batalla con X contadores +1/+1 si un oponente recibió daño este turno.",
      "example_card": "Scab-Clan Mauler",
      "example_card_es": "Aporreador del clan Costra"
    },
    {
      "keyword": "Bolster",
      "keyword_es": "Reforzar",
      "definition": "Written as 'Bolster X'. Whenever a creature with bolster attacks, put X +1/+1 counters on target creature you control with the lowest toughness.",
      "definition_es": "Escrito como 'Reforzar X'. Cuando una criatura con reforzar ataca, pon X contadores +1/+1 en la criatura objetivo que controlas con la menor resistencia.",
      "example_card": "Dromoka, the Eternal",
      "example_card_es": "Dromoka, la eterna"
    },
    {
      "keyword": "Bushido",
      "keyword_es": "Bushido",
      "definition": "Written as 'Bushido X'. If a creature with bushido is blocked or blocks, it gets +X/+X until end of turn.",
      "definition_es": "Escrito como 'Bushido X'. Si una criatura con bushido es bloqueada o bloquea, obtiene +X/+X hasta el final del turno.",
      "example_card": "Devoted Retainer",
      "example_card_es": "Sirviente devoto"
    },
    {
      "keyword": "Buyback",
      "keyword_es": "Recompra",
      "definition": "Written as 'Buyback X'. When you cast a card with buyback, you may pay the cost to return it to your hand instead of putting it into the graveyard.",
      "definition_es": "Escrito como 'Recompra X'. Cuando lanzas una carta con recompra, puedes pagar el coste para devolverla a tu mano en vez de ponerla en el cementerio.",
      "example_card": "Capsize",
      "example_card_es": "Volcar"
    },
    {
      "keyword": "Cascade",
      "keyword_es": "Cascada",
      "definition": "Whenever you cast a card with cascade, exile cards from the top of your library until you find a card with a lesser mana value. You may cast that card without paying its mana cost.",
      "definition_es": "Cuando lanzas una carta con cascada, exilia cartas de la parte superior de tu biblioteca hasta encontrar una carta con menor valor de maná. Puedes lanzar esa carta sin pagar su coste de maná.",
      "example_card": "Bloodbraid Elf",
      "example_card_es": "Elfo trenzador de sangre"
    },
    {
      "keyword": "Casualty",
      "keyword_es": "Bajas",
      "definition": "Written as 'Casualty X'. When you cast a card with casualty, you may sacrifice a creature with power equal to X to copy the spell.",
      "definition_es": "Escrito como 'Bajas X'. Cuando lanzas una carta con bajas, puedes sacrificar una criatura con fuerza igual a X para copiar el hechizo.",
      "example_card": "A Little Chat",
      "example_card_es": "Una pequeña charla"
    },
    {
      "keyword": "Champion",
      "keyword_es": "Campeón",
      "definition": "Written as 'Champion a [creature type]'. When you cast a creature with champion, you must exile a card of the specified type. If the champion card leaves play, the exiled card returns.",
      "definition_es": "Escrito como 'Campeón un [tipo de criatura]'. Cuando lanzas una criatura con campeón, debes exiliar una carta del tipo especificado. Si la carta de campeón deja el juego, la carta exiliada regresa.",
      "example_card": "Wanderwine Prophets",
      "example_card_es": "Profetas de Vinoerrante"
    },
    {
      "keyword": "Changeling",
      "keyword_es": "Cambiaforma",
      "definition": "Creatures with changeling count as all creature types.",
      "definition_es": "Las criaturas con cambiaforma cuentan como todos los tipos de criatura.",
      "example_card": "Chameleon Colossus",
      "example_card_es": "Coloso camaleón"
    },
    {
      "keyword": "Channel",
      "keyword_es": "Canalizar",
      "definition": "Written as 'Channel [cost]'. You may pay the channel cost to discard the card and yield some effect.",
      "definition_es": "Escrito como 'Canalizar [coste]'. Puedes pagar el coste de canalizar para descartar la carta y obtener algún efecto.",
      "example_card": "Greater Tanuki",
      "example_card_es": "Tanuki mayor"
    },
    {
      "keyword": "Cipher",
      "keyword_es": "Cifrado",
      "definition": "When you cast a spell with cipher, you may exile it and attach it to a creature. Whenever that creature deals damage, you may cast the ciphered spell.",
      "definition_es": "Cuando lanzas un hechizo con cifrado, puedes exiliarlo y acoplarlo a una criatura. Cuando esa criatura haga daño, puedes lanzar el hechizo cifrado.",
      "example_card": "Call of the Nightwing",
      "example_card_es": "Llamado del alanoche"
    },
    {
      "keyword": "Connive",
      "keyword_es": "Maquinar",
      "definition": "Whenever a card connives, you draw and discard a card. If a nonland card was discarded, put a +1/+1 counter on the creature.",
      "definition_es": "Cuando una carta maquina, robas y descartas una carta. Si descartas una carta que no es tierra, pon un contador +1/+1 en la criatura.",
      "example_card": "Ledger Shredder",
      "example_card_es": "Triturador de registros"
    },
    {
      "keyword": "Conspire",
      "keyword_es": "Conspirar",
      "definition": "When you cast a spell with conspire, you may tap 2 creatures that share a color with the spell to copy it.",
      "definition_es": "Cuando lanzas un hechizo con conspirar, puedes girar 2 criaturas que compartan color con el hechizo para copiarlo.",
      "example_card": "Giantbaiting",
      "example_card_es": "Cebando gigantes"
    },
    {
      "keyword": "Convoke",
      "keyword_es": "Convocar",
      "definition": "Allows you to tap creatures to pay for the cost of a spell.",
      "definition_es": "Te permite girar criaturas para pagar el coste de un hechizo.",
      "example_card": "March of the Multitudes",
      "example_card_es": "Marcha de las multitudes"
    },
    {
      "keyword": "Coven",
      "keyword_es": "Concilio",
      "definition": "If you control at least 3 creatures with different powers, creatures with coven gain some benefit.",
      "definition_es": "Si controlas al menos 3 criaturas con diferentes fuerzas, las criaturas con concilio obtienen algún beneficio.",
      "example_card": "Augur of Autumn",
      "example_card_es": "Augurio de otoño"
    },
    {
      "keyword": "Crew",
      "keyword_es": "Tripular",
      "definition": "Written as 'Crew X'. To crew a vehicle, tap creatures with total power equal to or greater than X.",
      "definition_es": "Escrito como 'Tripular X'. Para tripular un vehículo, gira criaturas con poder total igual o mayor a X.",
      "example_card": "Aethersphere Harvester",
      "example_card_es": "Cosechador de esfera de éter"
    },
    {
      "keyword": "Cumulative Upkeep",
      "keyword_es": "Mantenimiento acumulativo",
      "definition": "Written as 'Cumulative Upkeep [cost]'. The cost compounds each turn and must be paid at the beginning of your upkeep.",
      "definition_es": "Escrito como 'Mantenimiento acumulativo [coste]'. El coste se acumula cada turno y debe pagarse al comienzo de tu mantenimiento.",
      "example_card": "Mystic Remora",
      "example_card_es": "Rémora mística"
    },
    {
      "keyword": "Cycling",
      "keyword_es": "Ciclo",
      "definition": "Written as 'Cycling [cost]'. You may pay the cycling cost and discard the card to draw a new card.",
      "definition_es": "Escrito como 'Ciclo [coste]'. Puedes pagar el coste de ciclo y descartar la carta para robar una nueva carta.",
      "example_card": "Cast Out",
      "example_card_es": "Desterrar"
    },
    {
      "keyword": "Dash",
      "keyword_es": "Arremeter",
      "definition": "You may pay the dash cost for a creature. It gains haste and returns to your hand at the end of the turn.",
      "definition_es": "Puedes pagar el coste de arremeter por una criatura. Gana prisa y regresa a tu mano al final del turno.",
      "example_card": "Ragavan, Nimble Pilferer",
      "example_card_es": "Ragavan, ladrón ágil"
    },
    {
      "keyword": "Daybound/Nightbound",
      "keyword_es": "Vinculado al día/Vinculado a la noche",
      "definition": "The day/night cycle is introduced by a card with daybound/nightbound. It changes based on the number of spells cast each turn.",
      "definition_es": "El ciclo día/noche es introducido por una carta con vinculado al día/vinculado a la noche. Cambia según la cantidad de hechizos lanzados cada turno.",
      "example_card": "Brutal Cathar",
      "example_card_es": "Cátaro brutal"
    },
    {
      "keyword": "Delve",
      "keyword_es": "Hurgar",
      "definition": "Allows you to exile cards from your graveyard to pay the generic mana cost of the card.",
      "definition_es": "Te permite exiliar cartas de tu cementerio para pagar el coste de maná genérico de la carta.",
      "example_card": "Treasure Cruise",
      "example_card_es": "Crucero del tesoro"
    },
    {
      "keyword": "Detain",
      "keyword_es": "Detener",
      "definition": "When a permanent is detained, it cannot attack, block, or activate abilities until the start of the next turn.",
      "definition_es": "Cuando un permanente es detenido, no puede atacar, bloquear o activar habilidades hasta el comienzo del próximo turno.",
      "example_card": "Lavinia of the Tenth",
      "example_card_es": "Lavinia de la Décima"
    },
    {
      "keyword": "Devour",
      "keyword_es": "Devorar",
      "definition": "Written as 'Devour X'. When a creature with devour enters the battlefield, you may sacrifice creatures to put +1/+1 counters on it.",
      "definition_es": "Escrito como 'Devorar X'. Cuando una criatura con devorar entra al campo de batalla, puedes sacrificar criaturas para poner contadores +1/+1 en ella.",
      "example_card": "Predator Dragon",
      "example_card_es": "Dragón depredador"
    },
    {
      "keyword": "Disturb",
      "keyword_es": "Perturbar",
      "definition": "Written as 'Disturb [cost]'. When a card with disturb is in your graveyard, you may cast it for its disturb cost to enter the battlefield transformed.",
      "definition_es": "Escrito como 'Perturbar [coste]'. Cuando una carta con perturbar está en tu cementerio, puedes lanzarla por su coste de perturbar para entrar al campo de batalla transformada.",
      "example_card": "Lunarch Veteran",
      "example_card_es": "Veterano de Lunarch"
    },
    {
      "keyword": "Dredge",
      "keyword_es": "Dragar",
      "definition": "Written as 'Dredge X'. If a card with dredge is in your graveyard, you may put the top X cards of your library into your graveyard and return the dredge card to your hand.",
      "definition_es": "Escrito como 'Dragar X'. Si una carta con dragar está en tu cementerio, puedes poner las X cartas superiores de tu biblioteca en tu cementerio y devolver la carta de dragar a tu mano.",
      "example_card": "Life from the Loam",
      "example_card_es": "Vida del mantillo"
    },
    {
      "keyword": "Echo",
      "keyword_es": "Eco",
      "definition": "Written as 'Echo [cost]'. At the beginning of your upkeep, you must pay the echo cost or sacrifice the creature.",
      "definition_es": "Escrito como 'Eco [coste]'. Al comienzo de tu mantenimiento, debes pagar el coste de eco o sacrificar la criatura.",
      "example_card": "Avalanche Riders",
      "example_card_es": "Jinetes de avalancha"
    },
    {
      "keyword": "Embalm",
      "keyword_es": "Embalsamar",
      "definition": "Written as 'Embalm [cost]'. When a creature is in the graveyard, you may pay the embalm cost to exile it and create a token copy.",
      "definition_es": "Escrito como 'Embalsamar [coste]'. Cuando una criatura está en el cementerio, puedes pagar el coste de embalsamar para exiliarla y crear una ficha copia.",
      "example_card": "Aven Wind Guide",
      "example_card_es": "Guía del viento aven"
    },
    {
      "keyword": "Emerge",
      "keyword_es": "Emerger",
      "definition": "Allows you to sacrifice a creature and pay the difference between its mana cost and the emerge cost.",
      "definition_es": "Te permite sacrificar una criatura y pagar la diferencia entre su coste de maná y el coste de emerger.",
      "example_card": "None provided",
      "example_card_es": "No proporcionado"
    },
    {
      "keyword": "Entwine",
      "keyword_es": "Entrelazar",
      "definition": "Written as 'Entwine [cost]'. On cards with 2 options, you may pay the entwine cost to do both.",
      "definition_es": "Escrito como 'Entrelazar [coste]'. En cartas con 2 opciones, puedes pagar el coste de entrelazar para hacer ambas.",
      "example_card": "Tooth and Nail",
      "example_card_es": "Diente y uña"
    },
    {
      "keyword": "Epic",
      "keyword_es": "Épico",
      "definition": "After a card with epic resolves, you may no longer cast spells. It provides an ongoing benefit.",
      "definition_es": "Después de que se resuelva una carta con épico, no puedes lanzar más hechizos. Proporciona un beneficio continuo.",
      "example_card": "Enduring Ideal",
      "example_card_es": "Ideal perdurable"
    },
    {
      "keyword": "Escape",
      "keyword_es": "Escapar",
      "definition": "Written as 'Escape [cost]'. You may cast a card from the graveyard for its escape cost by exiling other cards.",
      "definition_es": "Escrito como 'Escapar [coste]'. Puedes lanzar una carta desde el cementerio por su coste de escapar exiliando otras cartas.",
      "example_card": "Cling to Dust",
      "example_card_es": "Aferrarse al polvo"
    },
    {
      "keyword": "Evoke",
      "keyword_es": "Evocar",
      "definition": "You may cast a card for its evoke cost, but it is sacrificed when it enters the battlefield.",
      "definition_es": "Puedes lanzar una carta por su coste de evocar, pero es sacrificada cuando entra al campo de batalla.",
      "example_card": "Mulldrifter",
      "example_card_es": "Mulldrifter"
    },
    {
      "keyword": "Evolve",
      "keyword_es": "Evolucionar",
      "definition": "Whenever a creature with greater power or toughness enters the battlefield, put a +1/+1 counter on the creature with evolve.",
      "definition_es": "Cuando una criatura con mayor fuerza o resistencia entra al campo de batalla, pon un contador +1/+1 en la criatura con evolucionar.",
      "example_card": "Experiment One",
      "example_card_es": "Experimento uno"
    },
    {
      "keyword": "Exalted",
      "keyword_es": "Exaltado",
      "definition": "Whenever a creature you control attacks alone, it gets +1/+1 for each instance of exalted.",
      "definition_es": "Cuando una criatura que controlas ataca sola, obtiene +1/+1 por cada instancia de exaltado.",
      "example_card": "Noble Hierarch",
      "example_card_es": "Jerarca noble"
    },
    {
      "keyword": "Exert",
      "keyword_es": "Esforzar",
      "definition": "When a creature with exert attacks, you may exert it to gain an ability, but it won't untap during your next untap step.",
      "definition_es": "Cuando una criatura con esforzar ataca, puedes esforzarla para ganar una habilidad, pero no se enderezará durante tu próximo paso de enderezar.",
      "example_card": "Glorybringer",
      "example_card_es": "Portador de gloria"
    },
    {
      "keyword": "Exploit",
      "keyword_es": "Explotar",
      "definition": "When you cast a card with exploit, you may sacrifice a creature to gain a benefit.",
      "definition_es": "Cuando lanzas una carta con explotar, puedes sacrificar una criatura para obtener un beneficio.",
      "example_card": "Fell Stinger",
      "example_card_es": "Aguijonero vil"
    },
    {
      "keyword": "Explore",
      "keyword_es": "Explorar",
      "definition": "When a creature with explore enters the battlefield, reveal the top card of your library. If it's a land, put it into your hand. If it's a nonland, you may put it into your graveyard and put a +1/+1 counter on the creature.",
      "definition_es": "Cuando una criatura con explorar entra al campo de batalla, revela la carta superior de tu biblioteca. Si es una tierra, ponla en tu mano. Si no es una tierra, puedes ponerla en tu cementerio y poner un contador +1/+1 en la criatura.",
      "example_card": "Merfolk Branchwalker",
      "example_card_es": "Caminarramas de los merfolk"
    },
    {
      "keyword": "Extort",
      "keyword_es": "Extorsionar",
      "definition": "Whenever you cast a spell, you may pay white or black mana. Each opponent loses 1 life, and you gain life equal to the life lost.",
      "definition_es": "Cuando lanzas un hechizo, puedes pagar maná blanco o negro. Cada oponente pierde 1 vida y ganas vida igual a la vida perdida.",
      "example_card": "Blind Obedience",
      "example_card_es": "Obediencia ciega"
    },
    {
      "keyword": "Fabricate",
      "keyword_es": "Fabricar",
      "definition": "Written as 'Fabricate X'. When a creature with fabricate enters the battlefield, you may put X +1/+1 counters on it or create X 1/1 servo tokens.",
      "definition_es": "Escrito como 'Fabricar X'. Cuando una criatura con fabricar entra al campo de batalla, puedes poner X contadores +1/+1 en ella o crear X fichas de servo 1/1.",
      "example_card": "Angel of Invention",
      "example_card_es": "Ángel de la invención"
    },
    {
      "keyword": "Fading",
      "keyword_es": "Desvanecimiento",
      "definition": "Written as 'Fading X'. Cards with fading enter with X fading counters. Remove one each upkeep. If you can't, sacrifice the card.",
      "definition_es": "Escrito como 'Desvanecimiento X'. Las cartas con desvanecimiento entran con X contadores de desvanecimiento. Remueve uno cada mantenimiento. Si no puedes, sacrifica la carta.",
      "example_card": "Tangle Wire",
      "example_card_es": "Alambre enredado"
    },
    {
      "keyword": "Fateseal",
      "keyword_es": "Sellar destino",
      "definition": "When you fateseal, you look at the top X cards of an opponent's library and decide what stays on top and what goes to the bottom.",
      "definition_es": "Cuando sellas destino, miras las X cartas superiores de la biblioteca de un oponente y decides cuál queda arriba y cuál va al fondo.",
      "example_card": "Spin into Myth",
      "example_card_es": "Girar hacia el mito"
    },
    {
      "keyword": "Fear",
      "keyword_es": "Miedo",
      "definition": "Creatures with fear cannot be blocked except by black or artifact creatures.",
      "definition_es": "Las criaturas con miedo no pueden ser bloqueadas excepto por criaturas negras o artefactos.",
      "example_card": "Dross Prowler",
      "example_card_es": "Merodeador de escoria"
    },
    {
      "keyword": "Flanking",
      "keyword_es": "Flanquear",
      "definition": "Whenever a creature with flanking is blocked, the blocking creature gets -1/-1 until end of turn.",
      "definition_es": "Cuando una criatura con flanquear es bloqueada, la criatura bloqueadora obtiene -1/-1 hasta el final del turno.",
      "example_card": "Benalish Cavalry",
      "example_card_es": "Caballería benaliana"
    },
    {
      "keyword": "Flashback",
      "keyword_es": "Flashback",
      "definition": "Written as 'Flashback [cost]'. When a card with flashback is in the graveyard, you may cast it for its flashback cost, then exile it.",
      "definition_es": "Escrito como 'Flashback [coste]'. Cuando una carta con flashback está en el cementerio, puedes lanzarla por su coste de flashback, luego exiliarla.",
      "example_card": "Faithless Looting",
      "example_card_es": "Saqueo sin fe"
    },
    {
      "keyword": "Flip",
      "keyword_es": "Voltear",
      "definition": "Flip cards are turned upside-down when a condition is met.",
      "definition_es": "Las cartas de voltear se giran al revés cuando se cumple una condición.",
      "example_card": "Erayo, Soratami Ascendant",
      "example_card_es": "Erayo, ascendiente soratami"
    },
    {
      "keyword": "Forecast",
      "keyword_es": "Prever",
      "definition": "Written as 'Forecast [cost]'. During your upkeep, you may pay the forecast cost and reveal the card from your hand to activate an ability.",
      "definition_es": "Escrito como 'Prever [coste]'. Durante tu mantenimiento, puedes pagar el coste de prever y revelar la carta de tu mano para activar una habilidad.",
      "example_card": "Proclamation of Rebirth",
      "example_card_es": "Proclamación de renacimiento"
    },
    {
      "keyword": "Foretell",
      "keyword_es": "Presagiar",
      "definition": "Written as 'Foretell [cost]'. During your turn, you may pay 2 to foretell a card. You may cast it for its foretell cost on a later turn.",
      "definition_es": "Escrito como 'Presagiar [coste]'. Durante tu turno, puedes pagar 2 para presagiar una carta. Puedes lanzarla por su coste de presagiar en un turno posterior.",
      "example_card": "Doomskar",
      "example_card_es": "Cataclismo"
    },
    {
      "keyword": "Frenzy",
      "keyword_es": "Frenesí",
      "definition": "Written as 'Frenzy X'. Whenever a creature with frenzy attacks and isn't blocked, it gets +X/+0 until end of turn.",
      "definition_es": "Escrito como 'Frenesí X'. Cuando una criatura con frenesí ataca y no es bloqueada, obtiene +X/+0 hasta el final del turno.",
      "example_card": "Frenzy Sliver",
      "example_card_es": "Fragmento de frenesí"
    },
    {
      "keyword": "Graft",
      "keyword_es": "Injertar",
      "definition": "Written as 'Graft X'. Creatures with graft enter as 0/0s with X +1/+1 counters. They may move counters to other creatures.",
      "definition_es": "Escrito como 'Injertar X'. Las criaturas con injertar entran como 0/0 con X contadores +1/+1. Pueden mover contadores a otras criaturas.",
      "example_card": "Plaxcaster Frogling",
      "example_card_es": "Ranaplax emisora"
    },
    {
      "keyword": "Gravestorm",
      "keyword_es": "Tormenta de tumbas",
      "definition": "When the spell is cast, copy it for each permanent that entered the graveyard this turn.",
      "definition_es": "Cuando el hechizo es lanzado, cópialo por cada permanente que haya entrado al cementerio este turno.",
      "example_card": "Bitter Ordeal",
      "example_card_es": "Prueba amarga"
    },
    {
      "keyword": "Haunt",
      "keyword_es": "Apestar",
      "definition": "When a creature or spell with haunt enters the graveyard, it is exiled and attached to a creature on the battlefield.",
      "definition_es": "Cuando una criatura o hechizo con apestar entra al cementerio, es exiliado y acoplado a una criatura en el campo de batalla.",
      "example_card": "Belfry Spirit",
      "example_card_es": "Espíritu del campanario"
    },
    {
      "keyword": "Hideaway",
      "keyword_es": "Escondite",
      "definition": "When a card with hideaway enters the battlefield, you may exile a card from the top of your library. When a condition is met, you may cast the exiled card.",
      "definition_es": "Cuando una carta con escondite entra al campo de batalla, puedes exiliar una carta de la parte superior de tu biblioteca. Cuando se cumple una condición, puedes lanzar la carta exiliada.",
      "example_card": "Mosswort Bridge",
      "example_card_es": "Puente Musgoso"
    },
    {
      "keyword": "Horsemanship",
      "keyword_es": "Equitación",
      "definition": "Creatures with horsemanship can't be blocked by creatures without horsemanship.",
      "definition_es": "Las criaturas con equitación no pueden ser bloqueadas por criaturas sin equitación.",
      "example_card": "Sun Quan, Lord of Wu",
      "example_card_es": "Sun Quan, señor de Wu"
    },
    {
      "keyword": "Imprint",
      "keyword_es": "Imprimir",
      "definition": "When a card with imprint enters the battlefield, it exiles something and provides a boon based on that.",
      "definition_es": "Cuando una carta con imprimir entra al campo de batalla, exilia algo y proporciona un beneficio basado en eso.",
      "example_card": "Extraplanar Lens",
      "example_card_es": "Lente extraplanar"
    },
    {
      "keyword": "Indestructible",
      "keyword_es": "Indestructible",
      "definition": "Creatures with indestructible cannot be destroyed or die from damage.",
      "definition_es": "Las criaturas indestructibles no pueden ser destruidas ni morir por daño.",
      "example_card": "Avacyn, Angel of Hope",
      "example_card_es": "Avacyn, ángel de la esperanza"
    },
    {
      "keyword": "Inspired",
      "keyword_es": "Inspirado",
      "definition": "Whenever a card with inspired becomes untapped, something happens.",
      "definition_es": "Cuando una carta con inspirado se endereza, algo ocurre.",
      "example_card": "King Macar, the Gold-Cursed",
      "example_card_es": "Rey Macar, el maldito dorado"
    },
    {
      "keyword": "Investigate",
      "keyword_es": "Investigar",
      "definition": "Whenever a card investigates, create a clue token. Clue tokens can be sacrificed to draw a card.",
      "definition_es": "Cuando una carta investiga, crea una ficha de pista. Las fichas de pista pueden ser sacrificadas para robar una carta.",
      "example_card": "Thraben Inspector",
      "example_card_es": "Inspector de Thraben"
    },
    {
      "keyword": "Jump-start",
      "keyword_es": "Arranque",
      "definition": "Cards with jump-start may be cast from the graveyard by paying their mana cost and discarding a card.",
      "definition_es": "Las cartas con arranque pueden ser lanzadas desde el cementerio pagando su coste de maná y descartando una carta.",
      "example_card": "Radical Idea",
      "example_card_es": "Idea radical"
    },
    {
      "keyword": "Kicker",
      "keyword_es": "Patada",
      "definition": "Written as 'Kicker [cost]'. When you cast a spell, you may pay the kicker cost for an additional effect.",
      "definition_es": "Escrito como 'Patada [coste]'. Cuando lanzas un hechizo, puedes pagar el coste de patada para un efecto adicional.",
      "example_card": "Tourach, Dread Cantor",
      "example_card_es": "Tourach, cantor del terror"
    },
    {
      "keyword": "Level up",
      "keyword_es": "Subir de nivel",
      "definition": "Cards with level up enter at level 0. You may pay the level up cost to put a level counter on them, granting more abilities.",
      "definition_es": "Las cartas con subir de nivel entran en nivel 0. Puedes pagar el coste de subir de nivel para poner un contador de nivel en ellas, otorgando más habilidades.",
      "example_card": "Lighthouse Chronologist",
      "example_card_es": "Cronólogo del faro"
    },
    {
      "keyword": "Landwalk",
      "keyword_es": "Caminatierras",
      "definition": "Creatures with landwalk cannot be blocked if the defending player has a land of the specified type.",
      "definition_es": "Las criaturas con caminatierras no pueden ser bloqueadas si el jugador defensor tiene una tierra del tipo especificado.",
      "example_card": "Benthic Behemoth",
      "example_card_es": "Leviatán bentónico"
    },
    {
      "keyword": "Living Weapon",
      "keyword_es": "Arma viviente",
      "definition": "Cards with living weapon are equipment that generate a 0/0 germ token and attach to it when they enter the battlefield.",
      "definition_es": "Las cartas con arma viviente son equipamientos que generan una ficha de germen 0/0 y se acoplan a ella cuando entran al campo de batalla.",
      "example_card": "Batterskull",
      "example_card_es": "Casco de batalla"
    },
    {
      "keyword": "Madness",
      "keyword_es": "Locura",
      "definition": "Written as 'Madness [cost]'. When a spell with madness is discarded, you may cast it for its madness cost.",
      "definition_es": "Escrito como 'Locura [coste]'. Cuando un hechizo con locura es descartado, puedes lanzarlo por su coste de locura.",
      "example_card": "Basking Rootwalla",
      "example_card_es": "Rootwalla soleándose"
    },
    {
      "keyword": "Manifest",
      "keyword_es": "Manifestar",
      "definition": "Manifested cards are face-down 2/2 creatures. They may be turned face up for their mana cost.",
      "definition_es": "Las cartas manifestadas son criaturas boca abajo 2/2. Pueden ser giradas boca arriba pagando su coste de maná.",
      "example_card": "Reality Shift",
      "example_card_es": "Cambio de realidad"
    },
    {
      "keyword": "Meld",
      "keyword_es": "Fusionar",
      "definition": "Two cards can be melded together to create a single creature.",
      "definition_es": "Dos cartas pueden fusionarse para crear una sola criatura.",
      "example_card": "Brisela, Voice of Nightmares",
      "example_card_es": "Brisela, voz de las pesadillas"
    },
    {
      "keyword": "Mentor",
      "keyword_es": "Mentor",
      "definition": "Whenever a card with mentor attacks, put a +1/+1 counter on target attacking creature with less power.",
      "definition_es": "Cuando una carta con mentor ataca, pon un contador +1/+1 en la criatura atacante objetivo con menos poder.",
      "example_card": "Legion Warboss",
      "example_card_es": "Jefe de guerra de la legión"
    },
    {
      "keyword": "Miracle",
      "keyword_es": "Milagro",
      "definition": "You may cast a card for its miracle cost if it is the first card you draw in a turn.",
      "definition_es": "Puedes lanzar una carta por su coste de milagro si es la primera carta que robas en un turno.",
      "example_card": "Temporal Mastery",
      "example_card_es": "Maestría temporal"
    },
    {
      "keyword": "Modular",
      "keyword_es": "Modular",
      "definition": "Written as 'Modular X'. Creatures with modular enter with X +1/+1 counters. When they die, the counters may be moved to another artifact creature.",
      "definition_es": "Escrito como 'Modular X'. Las criaturas con modular entran con X contadores +1/+1. Cuando mueren, los contadores pueden moverse a otra criatura artefacto.",
      "example_card": "Arcbound Mouser",
      "example_card_es": "Cazarratones de arco"
    },
    {
      "keyword": "Monstrosity",
      "keyword_es": "Monstruosidad",
      "definition": "Written as '[cost]: Monstrosity X'. You may pay the cost to put X +1/+1 counters on the creature and gain an additional benefit.",
      "definition_es": "Escrito como '[coste]: Monstruosidad X'. Puedes pagar el coste para poner X contadores +1/+1 en la criatura y obtener un beneficio adicional.",
      "example_card": "Fleecemane Lion",
      "example_card_es": "León melenuda"
    },
    {
      "keyword": "Morph",
      "keyword_es": "Metamorfosis",
      "definition": "Written as 'Morph [cost]'. You may pay 3 generic mana to put the card face down as a 2/2 creature. You may pay the morph cost to flip it face up.",
      "definition_es": "Escrito como 'Metamorfosis [coste]'. Puedes pagar 3 maná genérico para poner la carta boca abajo como una criatura 2/2. Puedes pagar el coste de metamorfosis para girarla boca arriba.",
      "example_card": "Ainok Survivalist",
      "example_card_es": "Superviviente ainok"
    },
    {
      "keyword": "Mutate",
      "keyword_es": "Mutar",
      "definition": "Written as 'Mutate [cost]'. You may cast a creature for its mutate cost to mutate onto another non-human creature.",
      "definition_es": "Escrito como 'Mutar [coste]'. Puedes lanzar una criatura por su coste de mutar para mutar sobre otra criatura no humana.",
      "example_card": "Dirge Bat",
      "example_card_es": "Murciélago de réquiem"
    },
    {
      "keyword": "Ninjutsu",
      "keyword_es": "Ninjutsu",
      "definition": "Written as 'Ninjutsu [cost]'. You may return an unblocked attacking creature to put a ninja in its place, attacking.",
      "definition_es": "Escrito como 'Ninjutsu [coste]'. Puedes devolver una criatura atacante no bloqueada para poner un ninja en su lugar, atacando.",
      "example_card": "Ninja of the Deep Hours",
      "example_card_es": "Ninja de las horas profundas"
    },
    {
      "keyword": "Offering",
      "keyword_es": "Ofrenda",
      "definition": "Written as '[creature type] offering'. You may sacrifice a creature of the specified type to cast the card with offering, reducing its cost.",
      "definition_es": "Escrito como '[tipo de criatura] ofrenda'. Puedes sacrificar una criatura del tipo especificado para lanzar la carta con ofrenda, reduciendo su coste.",
      "example_card": "Patron of the Kitsune",
      "example_card_es": "Patrón de los kitsune"
    },
    {
      "keyword": "Overload",
      "keyword_es": "Sobrecarga",
      "definition": "Written as 'Overload [cost]'. When an instant or sorcery is overloaded, it affects all targets instead of one.",
      "definition_es": "Escrito como 'Sobrecarga [coste]'. Cuando un instantáneo o conjuro es sobrecargado, afecta a todos los objetivos en vez de uno.",
      "example_card": "Vandalblast",
      "example_card_es": "Explosión vandálica"
    },
    {
      "keyword": "Persist",
      "keyword_es": "Persistir",
      "definition": "If a creature with persist dies and had no -1/-1 counters, return it to the battlefield with a -1/-1 counter.",
      "definition_es": "Si una criatura con persistir muere y no tenía contadores -1/-1, regrésala al campo de batalla con un contador -1/-1.",
      "example_card": "Kitchen Finks",
      "example_card_es": "Finks de cocina"
    },
    {
      "keyword": "Phasing",
      "keyword_es": "Faseo",
      "definition": "Cards that are phased out are treated as though they don't exist. They return at the beginning of their controller's upkeep.",
      "definition_es": "Las cartas que están en faseo son tratadas como si no existieran. Regresan al comienzo del mantenimiento de su controlador.",
      "example_card": "Sandbar Crocodile",
      "example_card_es": "Cocodrilo del banco de arena"
    },
    {
      "keyword": "Poisonous",
      "keyword_es": "Venenoso",
      "definition": "Written as 'Poisonous X'. When a creature with poisonous deals damage to a player, that player gets X poison counters.",
      "definition_es": "Escrito como 'Venenoso X'. Cuando una criatura con venenoso hace daño a un jugador, ese jugador obtiene X contadores de veneno.",
      "example_card": "Virulent Sliver",
      "example_card_es": "Fragmento virulento"
    },
    {
      "keyword": "Populate",
      "keyword_es": "Poblar",
      "definition": "Make a copy of a creature token you control.",
      "definition_es": "Haz una copia de una ficha de criatura que controlas.",
      "example_card": "Growing Ranks",
      "example_card_es": "Rangos crecientes"
    },
    {
      "keyword": "Proliferate",
      "keyword_es": "Proliferar",
      "definition": "Whenever you proliferate, you may add an additional counter to anything that already has a counter.",
      "definition_es": "Cuando proliferas, puedes añadir un contador adicional a cualquier cosa que ya tenga un contador.",
      "example_card": "Grateful Apparition",
      "example_card_es": "Aparición agradecida"
    },
    {
      "keyword": "Provoke",
      "keyword_es": "Provocar",
      "definition": "When a creature with provoke attacks, you may target a creature the defending player controls. That creature must block the attacker.",
      "definition_es": "Cuando una criatura con provocar ataca, puedes elegir como objetivo una criatura que controle el jugador defensor. Esa criatura debe bloquear al atacante.",
      "example_card": "Lowland Tracker",
      "example_card_es": "Rastreador de tierras bajas"
    },
    {
      "keyword": "Prowl",
      "keyword_es": "Merodear",
      "definition": "Written as 'Prowl [cost]'. You may cast a creature for its prowl cost if a creature of the same type dealt damage to a player this turn.",
      "definition_es": "Escrito como 'Merodear [coste]'. Puedes lanzar una criatura por su coste de merodear si una criatura del mismo tipo hizo daño a un jugador este turno.",
      "example_card": "Latchkey Faerie",
      "example_card_es": "Hada llavín"
    },
    {
      "keyword": "Rampage",
      "keyword_es": "Furia",
      "definition": "Written as 'Rampage X'. Whenever a creature with rampage is blocked, it gets +X/+X for each creature blocking it.",
      "definition_es": "Escrito como 'Furia X'. Cuando una criatura con furia es bloqueada, obtiene +X/+X por cada criatura que la bloquee.",
      "example_card": "Craw Giant",
      "example_card_es": "Gigante reptante"
    },
    {
      "keyword": "Rebound",
      "keyword_es": "Rebote",
      "definition": "When you cast a card with rebound, exile it. You may cast it again without paying its mana cost on your next upkeep.",
      "definition_es": "Cuando lanzas una carta con rebote, exíliala. Puedes lanzarla de nuevo sin pagar su coste de maná en tu próximo mantenimiento.",
      "example_card": "Ephemerate",
      "example_card_es": "Efemerar"
    },
    {
      "keyword": "Recover",
      "keyword_es": "Recuperar",
      "definition": "Written as 'Recover [cost]'. When a creature is put into a graveyard, you may pay the recover cost to return the card to your hand.",
      "definition_es": "Escrito como 'Recuperar [coste]'. Cuando una criatura es puesta en un cementerio, puedes pagar el coste de recuperar para devolver la carta a tu mano.",
      "example_card": "Icefall",
      "example_card_es": "Cascada de hielo"
    },
    {
      "keyword": "Reinforce",
      "keyword_es": "Reforzar",
      "definition": "Written as 'Reinforce: X - [cost]'. You may discard the card and pay the reinforce cost to put X +1/+1 counters on target creature.",
      "definition_es": "Escrito como 'Reforzar: X - [coste]'. Puedes descartar la carta y pagar el coste de reforzar para poner X contadores +1/+1 en la criatura objetivo.",
      "example_card": "Burrenton Bombardier",
      "example_card_es": "Bombardero de Burrenton"
    },
    {
      "keyword": "Renown",
      "keyword_es": "Renombre",
      "definition": "Written as 'Renown X'. When a creature with renown deals combat damage to a player for the first time, put X +1/+1 counters on it.",
      "definition_es": "Escrito como 'Renombre X'. Cuando una criatura con renombre hace daño de combate a un jugador por primera vez, pon X contadores +1/+1 en ella.",
      "example_card": "Scab-Clan Berserker",
      "example_card_es": "Berserker del clan Costra"
    },
    {
      "keyword": "Replicate",
      "keyword_es": "Replicar",
      "definition": "Written as 'Replicate [cost]'. You may pay the replicate cost any number of times to copy the spell for each time you paid.",
      "definition_es": "Escrito como 'Replicar [coste]'. Puedes pagar el coste de replicar cualquier número de veces para copiar el hechizo por cada vez que pagaste.",
      "example_card": "Shattering Spree",
      "example_card_es": "Juerga destrozadora"
    },
    {
      "keyword": "Retrace",
      "keyword_es": "Retrazar",
      "definition": "Cards with retrace may be cast from the graveyard if you discard a land card in addition to paying their other costs.",
      "definition_es": "Las cartas con retrazar pueden ser lanzadas desde el cementerio si descartas una carta de tierra además de pagar sus otros costes.",
      "example_card": "Oona's Grace",
      "example_card_es": "Gracia de Oona"
    },
    {
      "keyword": "Riot",
      "keyword_es": "Motín",
      "definition": "When a creature with riot enters the battlefield, its controller chooses for it to enter with a +1/+1 counter or haste.",
      "definition_es": "Cuando una criatura con motín entra al campo de batalla, su controlador elige que entre con un contador +1/+1 o con prisa.",
      "example_card": "Gruul Spellbreaker",
      "example_card_es": "Rompehechizos de Gruul"
    },
    {
      "keyword": "Ripple",
      "keyword_es": "Ondulación",
      "definition": "Written as 'Ripple X'. When you cast a spell with ripple, you may reveal the top X cards of your library and cast copies of that card.",
      "definition_es": "Escrito como 'Ondulación X'. Cuando lanzas un hechizo con ondulación, puedes revelar las X cartas superiores de tu biblioteca y lanzar copias de esa carta.",
      "example_card": "Surging Dementia",
      "example_card_es": "Demencia creciente"
    },
    {
      "keyword": "Scavenge",
      "keyword_es": "Carroñear",
      "definition": "Written as 'Scavenge [cost]'. You may exile a card with scavenge from your graveyard to put +1/+1 counters on a creature.",
      "definition_es": "Escrito como 'Carroñear [coste]'. Puedes exiliar una carta con carroñear de tu cementerio para poner contadores +1/+1 en una criatura.",
      "example_card": "Deadbridge Goliath",
      "example_card_es": "Goliat de Puentemuerto"
    },
    {
      "keyword": "Shadow",
      "keyword_es": "Sombra",
      "definition": "Creatures with shadow can only block or be blocked by other creatures with shadow.",
      "definition_es": "Las criaturas con sombra sólo pueden bloquear o ser bloqueadas por otras criaturas con sombra.",
      "example_card": "Dauthi Cutthroat",
      "example_card_es": "Degollador dauthi"
    },
    {
      "keyword": "Shroud",
      "keyword_es": "Velo",
      "definition": "Creatures with shroud cannot be the target of spells or abilities.",
      "definition_es": "Las criaturas con velo no pueden ser objetivo de hechizos o habilidades.",
      "example_card": "Argothian Enchantress",
      "example_card_es": "Encantadora argothiana"
    },
    {
      "keyword": "Soulbond",
      "keyword_es": "Vínculo de alma",
      "definition": "Creatures with soulbond enter the battlefield and bond to another creature, granting both a boon.",
      "definition_es": "Las criaturas con vínculo de alma entran al campo de batalla y se vinculan a otra criatura, otorgando un beneficio a ambas.",
      "example_card": "Deadeye Navigator",
      "example_card_es": "Navegante ojo muerto"
    },
    {
      "keyword": "Soulshift",
      "keyword_es": "Traslado de alma",
      "definition": "Written as 'Soulshift X'. When a creature with soulshift dies, you may return a spirit card with mana value X or less to your hand.",
      "definition_es": "Escrito como 'Traslado de alma X'. Cuando una criatura con traslado de alma muere, puedes devolver una carta de espíritu con valor de maná X o menor a tu mano.",
      "example_card": "Elder Pine of Jukai",
      "example_card_es": "Pino anciano de Jukai"
    },
    {
      "keyword": "Spectacle",
      "keyword_es": "Espectáculo",
      "definition": "Written as 'Spectacle [cost]'. You may cast a card for its spectacle cost if an opponent was dealt damage this turn.",
      "definition_es": "Escrito como 'Espectáculo [coste]'. Puedes lanzar una carta por su coste de espectáculo si un oponente recibió daño este turno.",
      "example_card": "Light up the Stage",
      "example_card_es": "Iluminar el escenario"
    },
    {
      "keyword": "Splice",
      "keyword_es": "Empalmar",
      "definition": "Written as 'Splice onto X'. When you cast a card of the specified type, you may pay the splice cost to add the spliced card's effect to it.",
      "definition_es": "Escrito como 'Empalmar sobre X'. Cuando lanzas una carta del tipo especificado, puedes pagar el coste de empalmar para añadir el efecto de la carta empalmada.",
      "example_card": "Everdream",
      "example_card_es": "Sueño eterno"
    },
    {
      "keyword": "Split Second",
      "keyword_es": "Split Second",
      "definition": "A card with split second cannot be interacted with once it is on the stack.",
      "definition_es": "Una carta con split second no puede ser interactuada una vez que está en la pila.",
      "example_card": "Angel's Grace",
      "example_card_es": "Gracia del ángel"
    },
    {
      "keyword": "Storm",
      "keyword_es": "Tormenta",
      "definition": "When you cast a card with storm, copy it for each spell cast before it this turn.",
      "definition_es": "Cuando lanzas una carta con tormenta, cópiala por cada hechizo lanzado antes de ella este turno.",
      "example_card": "Grapeshot",
      "example_card_es": "Ráfaga de uvas"
    },
    {
      "keyword": "Sunburst",
      "keyword_es": "Estallido solar",
      "definition": "A card with sunburst enters with a counter for each color of mana used to cast it.",
      "definition_es": "Una carta con estallido solar entra con un contador por cada color de maná usado para lanzarla.",
      "example_card": "Engineered Explosives",
      "example_card_es": "Explosivos diseñados"
    },
    {
      "keyword": "Support",
      "keyword_es": "Apoyar",
      "definition": "Written as 'Support X'. Place a +1/+1 counter on up to X target creatures.",
      "definition_es": "Escrito como 'Apoyar X'. Pon un contador +1/+1 en hasta X criaturas objetivo.",
      "example_card": "Generous Patron",
      "example_card_es": "Patrono generoso"
    },
    {
      "keyword": "Surveil",
      "keyword_es": "Vigilar",
      "definition": "Written as 'Surveil X'. Look at the top X cards of your library. You may put any number into your graveyard and the rest back in any order.",
      "definition_es": "Escrito como 'Vigilar X'. Mira las X cartas superiores de tu biblioteca. Puedes poner cualquier cantidad en tu cementerio y el resto de vuelta en cualquier orden.",
      "example_card": "Notion Rain",
      "example_card_es": "Lluvia de nociones"
    },
    {
      "keyword": "Suspend",
      "keyword_es": "Suspender",
      "definition": "Written as 'Suspend X [cost]'. You may pay the suspend cost to exile the card with X time counters. Remove one each upkeep. When the last is removed, cast the spell.",
      "definition_es": "Escrito como 'Suspender X [coste]'. Puedes pagar el coste de suspender para exiliar la carta con X contadores de tiempo. Remueve uno cada mantenimiento. Cuando el último sea removido, lanza el hechizo.",
      "example_card": "Rift Bolt",
      "example_card_es": "Rayo de grieta"
    },
    {
      "keyword": "Totem Armor",
      "keyword_es": "Armadura de tótem",
      "definition": "If a creature with a totem armor aura would die, the aura is destroyed instead.",
      "definition_es": "Si una criatura con un aura de armadura de tótem fuera a morir, el aura es destruida en su lugar.",
      "example_card": "Bear Umbra",
      "example_card_es": "Umbra de oso"
    },
    {
      "keyword": "Transfigure",
      "keyword_es": "Transfigurar",
      "definition": "Written as 'Transfigure [cost]'. You may pay the transfigure cost and sacrifice the creature to search your library for a creature with the same mana value.",
      "definition_es": "Escrito como 'Transfigurar [coste]'. Puedes pagar el coste de transfigurar y sacrificar la criatura para buscar en tu biblioteca una criatura con el mismo valor de maná.",
      "example_card": "Fleshwrither",
      "example_card_es": "Escribidor de carne"
    },
    {
      "keyword": "Transform",
      "keyword_es": "Transformar",
      "definition": "When a condition is met, you may transform a double-faced card from its front side to its back side.",
      "definition_es": "Cuando se cumple una condición, puedes transformar una carta de doble cara de su lado frontal a su lado posterior.",
      "example_card": "Aberrant Researcher",
      "example_card_es": "Investigador aberrante"
    },
    {
      "keyword": "Transmute",
      "keyword_es": "Transmutar",
      "definition": "Written as 'Transmute [cost]'. You may pay the transmute cost and discard the card to search your library for a card with the same mana value.",
      "definition_es": "Escrito como 'Transmutar [coste]'. Puedes pagar el coste de transmutar y descartar la carta para buscar en tu biblioteca una carta con el mismo valor de maná.",
      "example_card": "Muddle the Mixture",
      "example_card_es": "Confundir la mezcla"
    },
    {
      "keyword": "Tribute",
      "keyword_es": "Tributo",
      "definition": "Written as 'Tribute X'. When a creature with tribute enters the battlefield, an opponent may put X +1/+1 counters on it. If they don't, another effect occurs.",
      "definition_es": "Escrito como 'Tributo X'. Cuando una criatura con tributo entra al campo de batalla, un oponente puede poner X contadores +1/+1 en ella. Si no lo hace, ocurre otro efecto.",
      "example_card": "Fanatic of Xenagos",
      "example_card_es": "Fanático de Xenagos"
    },
    {
      "keyword": "Undying",
      "keyword_es": "Inmortalidad",
      "definition": "When a creature with undying dies and had no +1/+1 counters, return it to the battlefield with a +1/+1 counter.",
      "definition_es": "Cuando una criatura con inmortalidad muere y no tenía contadores +1/+1, regrésala al campo de batalla con un contador +1/+1.",
      "example_card": "Young Wolf",
      "example_card_es": "Lobo joven"
    },
    {
      "keyword": "Unearth",
      "keyword_es": "Desenterrar",
      "definition": "Written as 'Unearth [cost]'. When a creature with unearth is in the graveyard, you may pay the unearth cost to return it to the battlefield with haste. Exile it at the end step.",
      "definition_es": "Escrito como 'Desenterrar [coste]'. Cuando una criatura con desenterrar está en el cementerio, puedes pagar el coste de desenterrar para regresarla al campo de batalla con prisa. Exíliala en el paso final.",
      "example_card": "Dregscape Zombie",
      "example_card_es": "Zombi de paisaje de posos"
    },
    {
      "keyword": "Unleash",
      "keyword_es": "Desatar",
      "definition": "When a creature with unleash enters the battlefield, you may choose for it to enter with a +1/+1 counter. If it has a counter, it cannot block.",
      "definition_es": "Cuando una criatura con desatar entra al campo de batalla, puedes elegir que entre con un contador +1/+1. Si tiene un contador, no puede bloquear.",
      "example_card": "Rakdos Cackler",
      "example_card_es": "Reidor de Rakdos"
    },
    {
      "keyword": "Wither",
      "keyword_es": "Marchitar",
      "definition": "If a creature would be dealt damage by a creature with wither, it gets -1/-1 counters instead.",
      "definition_es": "Si una criatura fuera a recibir daño de una criatura con marchitar, obtiene contadores -1/-1 en su lugar.",
      "example_card": "Harvest Gwyllion",
      "example_card_es": "Gwyllion de cosecha"
    }
  ],
  "Ability | Habilidad": [
    {
      "keyword": "Addendum",
      "keyword_es": "Adendo",
      "definition": "Cards with addendum have an added effect if cast in your main phase.",
      "definition_es": "Las cartas con adendo tienen un efecto adicional si son lanzadas en tu fase principal.",
      "example_card": "Emergency Powers",
      "example_card_es": "Poderes de emergencia"
    },
    {
      "keyword": "Battalion",
      "keyword_es": "Batallón",
      "definition": "Creatures with battalion have an additional effect trigger if they attack with at least 2 other creatures.",
      "definition_es": "Las criaturas con batallón tienen un efecto adicional que se activa si atacan con al menos otras 2 criaturas.",
      "example_card": "Legion Loyalist",
      "example_card_es": "Leal de la legión"
    },
    {
      "keyword": "Chroma",
      "keyword_es": "Croma",
      "definition": "Cards with chroma check for specific mana symbols in specific zones, then give a benefit based on that.",
      "definition_es": "Las cartas con croma buscan símbolos de maná específicos en zonas específicas, luego dan un beneficio basado en eso.",
      "example_card": "Fiery Bombardment",
      "example_card_es": "Bombardeo ígneo"
    },
    {
      "keyword": "Domain",
      "keyword_es": "Dominio",
      "definition": "Cards with domain have some effect related to the number of basic land types you control.",
      "definition_es": "Las cartas con dominio tienen algún efecto relacionado con la cantidad de tipos de tierra básica que controlas.",
      "example_card": "Prismatic Geoscope",
      "example_card_es": "Geoscopio prismático"
    },
    {
      "keyword": "Enrage",
      "keyword_es": "Ira",
      "definition": "If a creature with enrage is dealt damage, a trigger will occur.",
      "definition_es": "Si a una criatura con ira se le hace daño, se activará un disparador.",
      "example_card": "Ranging Raptors",
      "example_card_es": "Raptores de rango"
    },
    {
      "keyword": "Fateful Hour",
      "keyword_es": "Hora crucial",
      "definition": "Cards with fateful hour gain an additional ability if their controller is at 5 or less life.",
      "definition_es": "Las cartas con hora crucial ganan una habilidad adicional si su controlador tiene 5 o menos de vida.",
      "example_card": "Break of Day",
      "example_card_es": "Alba"
    },
    {
      "keyword": "Ferocious",
      "keyword_es": "Feroz",
      "definition": "Cards with ferocious gain an additional ability if their controller controls a creature with power 4 or greater.",
      "definition_es": "Las cartas con feroz ganan una habilidad adicional si su controlador controla una criatura con poder 4 o mayor.",
      "example_card": "Wild Slash",
      "example_card_es": "Tajo salvaje"
    },
    {
      "keyword": "Grandeur",
      "keyword_es": "Grandeza",
      "definition": "Allows you to discard a card with the same name to give it a bonus.",
      "definition_es": "Te permite descartar una carta con el mismo nombre para darle un bonus.",
      "example_card": "Baru, Fist of Krosa",
      "example_card_es": "Baru, puño de Krosa"
    },
    {
      "keyword": "Hellbent",
      "keyword_es": "Sin reservas",
      "definition": "Cards with hellbent give an additional benefit if you have no cards in hand when the card resolves.",
      "definition_es": "Las cartas con sin reservas dan un beneficio adicional si no tienes cartas en la mano cuando la carta se resuelve.",
      "example_card": "Infernal Tutor",
      "example_card_es": "Tutor infernal"
    },
    {
      "keyword": "Heroic",
      "keyword_es": "Heroico",
      "definition": "Cards with heroic grant an additional benefit when targeted with a spell.",
      "definition_es": "Las cartas con heroico otorgan un beneficio adicional cuando son objetivo de un hechizo.",
      "example_card": "Fabled Hero",
      "example_card_es": "Héroe legendario"
    },
    {
      "keyword": "Join Forces",
      "keyword_es": "Unir fuerzas",
      "definition": "Cards with join forces allow all players to contribute mana towards some effect.",
      "definition_es": "Las cartas con unir fuerzas permiten a todos los jugadores contribuir maná para algún efecto.",
      "example_card": "Collective Voyage",
      "example_card_es": "Viaje colectivo"
    },
    {
      "keyword": "Kinship",
      "keyword_es": "Parentesco",
      "definition": "On your upkeep, if you control a card with kinship, you may look at the top card of your library. If it shares a type with the kinship creature, you may reveal it for an effect.",
      "definition_es": "En tu mantenimiento, si controlas una carta con parentesco, puedes mirar la carta superior de tu biblioteca. Si comparte un tipo con la criatura con parentesco, puedes revelarla para un efecto.",
      "example_card": "Pyroclast Consul",
      "example_card_es": "Cónsul piroclasto"
    },
    {
      "keyword": "Landfall",
      "keyword_es": "Aterrizaje",
      "definition": "Cards with landfall have an ability that triggers when a land enters the battlefield.",
      "definition_es": "Las cartas con aterrizaje tienen una habilidad que se activa cuando una tierra entra al campo de batalla.",
      "example_card": "Khalni Heart Expedition",
      "example_card_es": "Expedición Corazón de Khalni"
    },
    {
      "keyword": "Metalcraft",
      "keyword_es": "Artesanía de metal",
      "definition": "Cards with metalcraft gain an additional benefit if you control 3 or more artifacts.",
      "definition_es": "Las cartas con artesanía de metal ganan un beneficio adicional si controlas 3 o más artefactos.",
      "example_card": "Puresteel Paladin",
      "example_card_es": "Paladín de acero puro"
    },
    {
      "keyword": "Morbid",
      "keyword_es": "Mórbido",
      "definition": "Cards with morbid gain some effect if a creature died that turn.",
      "definition_es": "Las cartas con mórbido ganan algún efecto si una criatura murió ese turno.",
      "example_card": "Tragic Slip",
      "example_card_es": "Resbalón trágico"
    },
    {
      "keyword": "Radiance",
      "keyword_es": "Resplandor",
      "definition": "If you target a permanent with a spell, that spell affects all permanents of the same type that share a color.",
      "definition_es": "Si eliges un permanente como objetivo con un hechizo, ese hechizo afecta a todos los permanentes del mismo tipo que compartan un color.",
      "example_card": "Rally the Righteous",
      "example_card_es": "Reunir a los justos"
    },
    {
      "keyword": "Raid",
      "keyword_es": "Incursión",
      "definition": "Cards with raid get some effect if their controller attacked before playing them.",
      "definition_es": "Las cartas con incursión obtienen algún efecto si su controlador atacó antes de jugarlas.",
      "example_card": "Bloodsoaked Champion",
      "example_card_es": "Campeón empapado en sangre"
    },
    {
      "keyword": "Rally",
      "keyword_es": "Reunión",
      "definition": "Cards with rally have an effect trigger whenever a creature with the type Ally enters the battlefield.",
      "definition_es": "Las cartas con reunión tienen un efecto que se activa cuando una criatura del tipo Aliado entra al campo de batalla.",
      "example_card": "Lantern Scout",
      "example_card_es": "Explorador de linterna"
    },
    {
      "keyword": "Sweep",
      "keyword_es": "Barrido",
      "definition": "When you cast a spell with sweep, you may return any number of lands of the specified type to gain an effect.",
      "definition_es": "Cuando lanzas un hechizo con barrido, puedes devolver cualquier número de tierras del tipo especificado para ganar un efecto.",
      "example_card": "Charge Across the Araba",
      "example_card_es": "Carga a través de Araba"
    },
    {
      "keyword": "Threshold",
      "keyword_es": "Umbral",
      "definition": "Cards with threshold gain some effect when you have 7 or more cards in the graveyard.",
      "definition_es": "Las cartas con umbral ganan algún efecto cuando tienes 7 o más cartas en el cementerio.",
      "example_card": "Nimble Mongoose",
      "example_card_es": "Mangosta ágil"
    },
    {
      "keyword": "Undergrowth",
      "keyword_es": "Maleza",
      "definition": "Cards with undergrowth have effects dependent on the number of creatures in your graveyard.",
      "definition_es": "Las cartas con maleza tienen efectos que dependen de la cantidad de criaturas en tu cementerio.",
      "example_card": "Kraul Foragers",
      "example_card_es": "Forrajeros kraul"
    }
  ]
}